[
  {
    "title": "MT.8848 FC Married vs Unmarried Event",
    "date": "19 March 2025",
    "description": "We're thrilled to host this event and grateful for the overwhelming love and support from our community, sponsors, and supporters. Thank you to everyone who made it a success, especially our players, management team and sponsors. Together, we'll keep uniting our Nepali society.",
    "images": [
      "moments_page_image/1_1.jpg",
      "moments_page_image/1_2.jpg",
      "moments_page_image/1_3.jpg",
      "moments_page_image/1_4.jpg",
      "moments_page_image/1_5.jpg",
      "moments_page_image/1_6.jpg"
    ]
  },
  {
    "title": "Honorary Consul of Nepal Visits Mt. 8848 FC",
    "date": "23 Feb 2025",
    "description": "We were honored to welcome the Honorary Consul of Nepal to Auckland, New Zealand to our training session at Elm Park School. It was a proud moment to showcase how our team brings Nepalese students together through football, balancing studies, work, and life in a new country. Their dedication fosters unity, mental strength, and physical well-being.",
    "images": ["moments_page_image/2_1.jpg"]
  },
  {
    "title": "End of the Season: A Moment of Pride",
    "date": "20 Feb 2025",
    "description": "As the season comes to a close, we’re incredibly proud of everyone’s hard work and dedication. It’s been a journey close to perfection, and now we’re ready to compete for the cup in the next stage.",
    "images": ["moments_page_image/3_1.jpg", "moments_page_image/3_2.jpg"]
  },
  {
    "title": "10th Nepalese Football Tournament",
    "date": "4 Feb 2025",
    "description": "We’re proud to celebrate our experience at the 10th Nepalese Football Tournament, organized by the THC Committee and Southland Nepalese Society. Congratulations to Mt.8848 FC for winning the 'Fair Team Award'! Thank you to our sponsors, coaching team, and supporters for making this possible. Together, we’ll keep climbing higher. Mt.8848 to the summit!",
    "images": ["moments_page_image/4_1.jpg", "moments_page_image/4_2.jpg"]
  },
  {
    "title": "Gorkhali Friendship Cup 2024 Champions!",
    "date": "6th Oct 2024",
    "description": "From humble beginnings to lifting the Gorkhali Friendship Cup 2024, we’ve come a long way. A huge thank you to Gorkhali FC Waikato for hosting this incredible tournament. This victory is a testament to our hard work, teamwork, and dedication. We’ll keep this momentum going and aim for even greater achievements in the future.",
    "images": ["moments_page_image/5_1.jpg", "moments_page_image/5_2.jpg"]
  },
  {
    "title": "Mt. 8848 FC 1st Get-Together Picnic",
    "date": "3 Mar 2024",
    "description": "We believe in creating beautiful memories within our brotherhood, and the football pitch isn’t the only place to do so. Our first get-together picnic was a testament to that! A big thank you to all our executive members for their efforts in making this event special, and to all our members and brothers for your warm presence. Together, we shared great times and created lifelong memories.",
    "images": ["moments_page_image/6_1.jpg", "moments_page_image/6_2.jpg"]
  },
  {
    "title": "Everest Cup 2023: Hard Work and Dedication",
    "date": "25th Sep 2023",
    "description": "Our hardworking boys gave their best at the Everest Cup 2023, and we couldn’t be prouder! Every tackle, every pass, and every moment on the field showcased their dedication and teamwork. Well done, team! Your efforts inspire us all. Let’s keep pushing forward and aiming higher.",
    "images": [
      "moments_page_image/7_1.jpg",
      "moments_page_image/7_2.jpg",
      "moments_page_image/7_3.jpg",
      "moments_page_image/7_4.jpg",
      "moments_page_image/7_5.jpg",
      "moments_page_image/7_6.jpg"
    ]
  },
  {
    "title": "One-Day Futsal Tournament",
    "date": "4 Feb 2025",
    "description": "",
    "images": ["moments_page_image/8_1.jpg", "moments_page_image/8_1.jpg"]
  },
  {
    "title": "Our THC Debut: A Proud Beginning",
    "date": "4 Feb 2025",
    "description": "Though the results weren't in our favor, we're incredibly proud to have made our first appearance at the Tenzing Hillary Cup - New Zealand's most celebrated Nepali football tournament. This marks the start of our THC journey, and we're excited for what's to come.",
    "images": [
      "moments_page_image/9_1.jpg",
      "moments_page_image/9_2.jpg",
      "moments_page_image/9_3.jpg",
      "moments_page_image/9_4.jpg",
      "moments_page_image/9_5.jpg",
      "moments_page_image/9_6.jpg"
    ]
  }
]
